# Step 3: Import libraries and customer data set

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
df_customers = pd.read_csv(r'/Users/Luca2/Documents/Dropbox/Mein Mac (Air-von-Luca.fritz.box)/Desktop/Instacart Basket Analysis/02 Data/Original Data/customers.csv', index_col = False)

In [3]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
df_customers.shape

(206209, 10)

In [5]:
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [6]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

# Step 4: Wrangle the data

In [7]:
df_customers = df_customers.drop(['First Name', 'Surnam'], axis=1)

In [8]:
# Renaming columns
df_customers.rename(columns={"Gender":"gender", "STATE":"state",
                            "Age":"age", "n_dependants":"dependants", "fam_status":"family_status",}, inplace=True)

In [9]:
# Checking the changes
df_customers.head()

,user_id,gender,state,age,date_joined,dependants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int64
 1   gender         206209 non-null  object
 2   state          206209 non-null  object
 3   age            206209 non-null  int64
 4   date_joined    206209 non-null  object
 5   dependants     206209 non-null  int64
 6   family_status  206209 non-null  object
 7   income         206209 non-null  int64
dtypes: int64(4), object(4)
memory usage: 12.6+ MB

# Step 5: Complete the fundamental data quality and consistency checks

In [11]:
# Change the datatype 
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [12]:
df_customers['date_joined'] = pd.to_datetime(df_customers['date_joined'])

In [13]:
df_customers['age'] = df_customers['age'].astype('int8')
df_customers['dependants'] = df_customers['dependants'].astype('int8')

In [14]:
df_customers['income'] = df_customers['income'].astype('int32')

In [15]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  object
 1   gender         206209 non-null  object
 2   state          206209 non-null  object
 3   age            206209 non-null  int8
 4   date_joined    206209 non-null  datetime64[ns]
 5   dependants     206209 non-null  int8
 6   family_status  206209 non-null  object
 7   income         206209 non-null  int32
dtypes: datetime64[ns](1), int32(1), int8(2), object(4)
memory usage: 9.0+ MB

In [16]:
# Check for columns that have mixed type data 
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

In [17]:
# Check for missing values 
df_customers.isnull().sum()

user_id          0
gender           0
state            0
age              0
date_joined      0
dependants       0
family_status    0
income           0
dtype: int64

There are no missing values in the dataframe.

In [18]:
# Check for duplicates 
df_dups = df_customers[df_customers.duplicated()]

In [19]:
df_dups.shape

(0, 8)

There are no duplicates in the dataframe.

# Step 6: Combine your data

In [20]:
path = r'/Users/Luca2/Documents/Dropbox/Mein Mac (Air-von-Luca.fritz.box)/Desktop/Instacart Basket Analysis'

In [21]:
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge.pkl'))

In [22]:
df_ords_prods.shape

(32404859, 23)

In [23]:
df_ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int8
 3   orders_day_of_week      int8
 4   hour_of_day_ordered     int8
 5   days_since_prior_order  float32
 6   product_id              object
 7   add_to_cart_order       int32
 8   reordered               int8
 9   product_name            object
 10  aisle_id                int16
 11  department_id           int8
 12  prices                  float32
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int8
 18  loyalty_flag            object
 19  average_price           float32
 20  spending flag           object
 21  regularity              float32
 22  frequency flag          object
dtypes: float32(4), int16(1), int32(1), int8(6), object(11)
memory usage: 3.7+ GB

In [26]:
# Merging both dataframes using the user_id colum
orders_products_all = df_ords_prods.merge(df_customers, on=['user_id'])

In [27]:
orders_products_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 30 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int8
 3   orders_day_of_week      int8
 4   hour_of_day_ordered     int8
 5   days_since_prior_order  float32
 6   product_id              object
 7   add_to_cart_order       int32
 8   reordered               int8
 9   product_name            object
 10  aisle_id                int16
 11  department_id           int8
 12  prices                  float32
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int8
 18  loyalty_flag            object
 19  average_price           float32
 20  spending flag           object
 21  regularity              float32
 22  frequency flag          object
 23  gender                  object
 24  state                   object
 25  age                     int8
 26  date_joined             datetime64[ns]
 27  dependants              int8
 28  family_status           object
 29  income                  int32
dtypes: datetime64[ns](1), float32(4), int16(1), int32(2), int8(8), object(14)
memory usage: 4.9+ GB

In [29]:
orders_products_all.head(100)

,order_id,user_id,order_number,orders_day_of_week,hour_of_day_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,spending flag,regularity,frequency flag,gender,state,age,date_joined,dependants,family_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2019-02-17,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2019-02-17,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2019-02-17,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2019-02-17,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2019-02-17,3,married,40423
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,3317979,15,5,4,15,17.0,14715,1,1,Coconut Water,...,Low spender,10.0,Frequent customer,Female,Indiana,69,2019-06-03,0,divorced/widowed,54313
96,2685110,15,7,1,11,17.0,14715,3,1,Coconut Water,...,Low spender,10.0,Frequent customer,Female,Indiana,69,2019-06-03,0,divorced/widowed,54313
97,887727,15,9,2,13,7.0,14715,1,1,Coconut Water,...,Low spender,10.0,Frequent customer,Female,Indiana,69,2019-06-03,0,divorced/widowed,54313
98,2600170,15,11,2,9,14.0,14715,1,1,Coconut Water,...,Low spender,10.0,Frequent customer,Female,Indiana,69,2019-06-03,0,divorced/widowed,54313
99,2332087,15,13,1,10,14.0,14715,3,1,Coconut Water,...,Low spender,10.0,Frequent customer,Female,Indiana,69,2019-06-03,0,divorced/widowed,54313

# Step 8: Export this new dataframe as a pickle file

In [30]:
orders_products_all.to_pickle(os.path.join(path,'02 Data/Prepared Data/orders_products_all.pkl'))